In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

### Liczba zdarze≈Ñ drogowych w Warszawie 01.2018 - 12.2020

In [2]:
warszawa2018_20 = pd.read_excel("warszawa2018_20_v1.xlsx")

,ID,MIEJSCOWOSC,ULICA_ADRES,NUMER_DOMU,DATA_ZDARZ,GODZINA_ZDARZ,SZOS_KOD,SZRD_KOD,NADR_KOD,STNA_KOD,...,SPAK_KOD,INWALIDA,LICZBA_PASOW,ULICA_SKRZYZ,SSUP_KOD,RONDO_WEZEL,STREFA_ZAMIESZKALA,ODLEGLOSC_SKRZYZ,KIERUNEK,STREFA_RUCHU
0,106651967,WARSZAWA,BEMA,KASPRZAKA,2018-01-01,23:15:00,3,2,1.0,2,...,NaN,NaN,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,106651967,WARSZAWA,BEMA,KASPRZAKA,2018-01-01,23:15:00,3,2,NaN,NaN,...,NaN,NaN,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,106651967,WARSZAWA,BEMA,KASPRZAKA,2018-01-01,23:15:00,3,2,NaN,NaN,...,NaN,NaN,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,106651967,WARSZAWA,BEMA,KASPRZAKA,2018-01-01,23:15:00,3,2,NaN,NaN,...,NaN,NaN,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,106651967,WARSZAWA,BEMA,KASPRZAKA,2018-01-01,23:15:00,3,2,NaN,NaN,...,NaN,NaN,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
609040,109702103,WARSZAWA,KONWIKTORSKA,NaN,2020-12-31,07:20:00,1,03,NaN,NaN,...,NaN,NaN,2.0,BONIFRATERSKA,NaN,NaN,NaN,NaN,NaN,NaN
609041,109702103,WARSZAWA,KONWIKTORSKA,NaN,2020-12-31,07:20:00,1,03,NaN,NaN,...,NaN,NaN,2.0,BONIFRATERSKA,NaN,NaN,NaN,NaN,NaN,NaN
609042,109702103,WARSZAWA,KONWIKTORSKA,NaN,2020-12-31,07:20:00,1,03,NaN,NaN,...,NaN,NaN,2.0,BONIFRATERSKA,NaN,NaN,NaN,NaN,NaN,NaN
609043,109702103,WARSZAWA,KONWIKTORSKA,NaN,2020-12-31,07:20:00,1,03,NaN,NaN,...,NaN,NaN,2.0,BONIFRATERSKA,NaN,NaN,NaN,NaN,NaN,NaN
609044,109702103,WARSZAWA,KONWIKTORSKA,NaN,2020-12-31,07:20:00,1,03,NaN,NaN,...,NaN,NaN,2.0,BONIFRATERSKA,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
wypadki2018_20 = warszawa2018_20[['ID','DATA_ZDARZ']]
wypadki2018_20

               ID DATA_ZDARZ
0       106651967 2018-01-01
1       106651967 2018-01-01
2       106651967 2018-01-01
3       106651967 2018-01-01
4       106651967 2018-01-01
...           ...        ...
609040  109702103 2020-12-31
609041  109702103 2020-12-31
609042  109702103 2020-12-31
609043  109702103 2020-12-31
609044  109702103 2020-12-31

[609045 rows x 2 columns]

In [4]:
wypadki2018_20 = wypadki2018_20.drop_duplicates()
wypadki2018_20

               ID DATA_ZDARZ
0       106651967 2018-01-01
7       106650103 2018-01-01
13      106658062 2018-01-01
20      106650043 2018-01-01
27      106651432 2018-01-01
...           ...        ...
609009  109702327 2020-12-31
609015  109702571 2020-12-31
609024  109703291 2020-12-31
609031  109702113 2020-12-31
609038  109702103 2020-12-31

[86078 rows x 2 columns]

In [5]:
wypadki2018_20 = wypadki2018_20.groupby("DATA_ZDARZ")["ID"].count()
wypadki2018_20

DATA_ZDARZ
2018-01-01     27
2018-01-02     72
2018-01-03     93
2018-01-04     81
2018-01-05    117
             ...
2020-12-27     24
2020-12-28     54
2020-12-29     72
2020-12-30     83
2020-12-31     48
Name: ID, Length: 1096, dtype: int64

In [6]:
wypadki2018_20.to_excel("all_zdarzenia_warszawa2018_20.xlsx")

### Liczba zdarze≈Ñ drogowych 01.2018 - 10.2021

In [7]:
warszawa2018_21 = pd.read_excel("warszawa2018_21_v1.xlsx")

,ID,MIEJSCOWOSC,ULICA_ADRES,NUMER_DOMU,DATA_ZDARZ,GODZINA_ZDARZ,SZOS_KOD,SZRD_KOD,NADR_KOD,STNA_KOD,...,SPAK_KOD,INWALIDA,LICZBA_PASOW,ULICA_SKRZYZ,SSUP_KOD,RONDO_WEZEL,STREFA_ZAMIESZKALA,ODLEGLOSC_SKRZYZ,KIERUNEK,STREFA_RUCHU
0,106651967,WARSZAWA,BEMA,KASPRZAKA,2018-01-01,23:15:00,3,2,1.0,2,...,NaN,NaN,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,106651967,WARSZAWA,BEMA,KASPRZAKA,2018-01-01,23:15:00,3,2,NaN,NaN,...,NaN,NaN,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,106651967,WARSZAWA,BEMA,KASPRZAKA,2018-01-01,23:15:00,3,2,NaN,NaN,...,NaN,NaN,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,106651967,WARSZAWA,BEMA,KASPRZAKA,2018-01-01,23:15:00,3,2,NaN,NaN,...,NaN,NaN,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,106651967,WARSZAWA,BEMA,KASPRZAKA,2018-01-01,23:15:00,3,2,NaN,NaN,...,NaN,NaN,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
759337,113354834,WARSZAWA,OSTROBRAMSKA,NaN,2021-10-31,17:30:00,3,3,NaN,NaN,...,NaN,NaN,NaN,RODZIEWICZ√ìWNY,NaN,NaN,NaN,NaN,NaN,NaN
759338,113354834,WARSZAWA,OSTROBRAMSKA,NaN,2021-10-31,17:30:00,3,3,NaN,NaN,...,NaN,NaN,NaN,RODZIEWICZ√ìWNY,NaN,NaN,NaN,NaN,NaN,NaN
759339,113354834,WARSZAWA,OSTROBRAMSKA,NaN,2021-10-31,17:30:00,3,3,NaN,NaN,...,NaN,NaN,NaN,RODZIEWICZ√ìWNY,NaN,NaN,NaN,NaN,NaN,NaN
759340,113354834,WARSZAWA,OSTROBRAMSKA,NaN,2021-10-31,17:30:00,3,3,NaN,NaN,...,NaN,NaN,NaN,RODZIEWICZ√ìWNY,NaN,NaN,NaN,NaN,NaN,NaN
759341,113354834,WARSZAWA,OSTROBRAMSKA,NaN,2021-10-31,17:30:00,3,3,NaN,NaN,...,NaN,NaN,NaN,RODZIEWICZ√ìWNY,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
wypadki2018_21 = warszawa2018_21[['ID','DATA_ZDARZ']]
wypadki2018_21 = wypadki2018_21.drop_duplicates()
wypadki2018_21

               ID DATA_ZDARZ
0       106651967 2018-01-01
7       106650103 2018-01-01
13      106658062 2018-01-01
20      106650043 2018-01-01
27      106651432 2018-01-01
...           ...        ...
759303  113059949 2021-10-31
759311  113059955 2021-10-31
759319  113060480 2021-10-31
759328  113085415 2021-10-31
759335  113354834 2021-10-31

[107119 rows x 2 columns]

In [10]:
wypadki2018_21 = wypadki2018_21.groupby("DATA_ZDARZ")["ID"].count()
wypadki2018_21

DATA_ZDARZ
2018-01-01     27
2018-01-02     72
2018-01-03     93
2018-01-04     81
2018-01-05    117
             ...
2021-10-27     98
2021-10-28     70
2021-10-29    108
2021-10-30     67
2021-10-31     36
Name: ID, Length: 1400, dtype: int64

In [11]:
wypadki2018_21.to_excel("all_zdarzenia_warszawa2018_21.xlsx")

### Liczba zdarze≈Ñ drogowych z udzia≈Çem pieszych 01.2018-12.2020

In [15]:
pedestrian_wypadki2018_20 = warszawa2018_20[['ID','DATA_ZDARZ','SSRU_KOD']]
pedestrian_wypadki2018_20

               ID DATA_ZDARZ SSRU_KOD
0       106651967 2018-01-01      NaN
1       106651967 2018-01-01      NaN
2       106651967 2018-01-01      NaN
3       106651967 2018-01-01      NaN
4       106651967 2018-01-01      NaN
...           ...        ...      ...
609040  109702103 2020-12-31      NaN
609041  109702103 2020-12-31      NaN
609042  109702103 2020-12-31      NaN
609043  109702103 2020-12-31        K
609044  109702103 2020-12-31        K

[609045 rows x 3 columns]

In [16]:
pedestrian_wypadki2018_20.drop(pedestrian_wypadki2018_20.loc[pedestrian_wypadki2018_20['SSRU_KOD']!='I'].index, inplace=True)
pedestrian_wypadki2018_20

C:\Users\aleks\anaconda3\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

               ID DATA_ZDARZ SSRU_KOD
95      106657592 2018-01-01        I
134     106651385 2018-01-01        I
219     106651781 2018-01-02        I
742     106656102 2018-01-03        I
872     106691249 2018-01-03        I
...           ...        ...      ...
608389  109701649 2020-12-30        I
608390  109701649 2020-12-30        I
608569  109700635 2020-12-30        I
608738  109702697 2020-12-31        I
608892  109703348 2020-12-31        I

[2892 rows x 3 columns]

In [17]:
pedestrian_wypadki2018_20.drop_duplicates(subset='ID')
pedestrian_wypadki2018_20

               ID DATA_ZDARZ SSRU_KOD
95      106657592 2018-01-01        I
134     106651385 2018-01-01        I
219     106651781 2018-01-02        I
742     106656102 2018-01-03        I
872     106691249 2018-01-03        I
...           ...        ...      ...
608389  109701649 2020-12-30        I
608390  109701649 2020-12-30        I
608569  109700635 2020-12-30        I
608738  109702697 2020-12-31        I
608892  109703348 2020-12-31        I

[2892 rows x 3 columns]

In [18]:
pedestrian_wypadki2018_20 = pedestrian_wypadki2018_20.groupby("DATA_ZDARZ")["ID"].count()
pedestrian_wypadki2018_20

DATA_ZDARZ
2018-01-01    2
2018-01-02    1
2018-01-03    6
2018-01-04    5
2018-01-05    7
             ..
2020-12-24    1
2020-12-25    1
2020-12-28    1
2020-12-30    6
2020-12-31    2
Name: ID, Length: 937, dtype: int64

In [19]:
pedestrian_wypadki2018_20.to_excel("pedestrian_zdarzenia_warszawa2018_21.xlsx")

### Liczba zdarze≈Ñ drogowych z udzia≈Çem rowerzyst√≥w 01.2018-12.2020

In [20]:
bike_wypadki2018_20 = warszawa2018_20[['ID','DATA_ZDARZ','RODZAJ_POJAZDU']]
bike_wypadki2018_20

               ID DATA_ZDARZ RODZAJ_POJAZDU
0       106651967 2018-01-01            NaN
1       106651967 2018-01-01            NaN
2       106651967 2018-01-01            NaN
3       106651967 2018-01-01          IS121
4       106651967 2018-01-01          IS107
...           ...        ...            ...
609040  109702103 2020-12-31            NaN
609041  109702103 2020-12-31          IS121
609042  109702103 2020-12-31          IS121
609043  109702103 2020-12-31            NaN
609044  109702103 2020-12-31            NaN

[609045 rows x 3 columns]

In [21]:
bike_wypadki2018_20.drop(bike_wypadki2018_20.loc[bike_wypadki2018_20['RODZAJ_POJAZDU']!='IS101'].index, inplace=True)
bike_wypadki2018_20

C:\Users\aleks\anaconda3\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

               ID DATA_ZDARZ RODZAJ_POJAZDU
326     106652207 2018-01-02          IS101
1427    106663984 2018-01-04          IS101
2060    106664032 2018-01-05          IS101
2254    106660265 2018-01-05          IS101
2831    106660274 2018-01-06          IS101
...           ...        ...            ...
607361  109696436 2020-12-28          IS101
607753  109699161 2020-12-29          IS101
608195  109701247 2020-12-30          IS101
608263  109701696 2020-12-30          IS101
608945  109703421 2020-12-31          IS101

[3153 rows x 3 columns]

In [22]:
bike_wypadki2018_20.drop_duplicates(subset='ID')
bike_wypadki2018_20

               ID DATA_ZDARZ RODZAJ_POJAZDU
326     106652207 2018-01-02          IS101
1427    106663984 2018-01-04          IS101
2060    106664032 2018-01-05          IS101
2254    106660265 2018-01-05          IS101
2831    106660274 2018-01-06          IS101
...           ...        ...            ...
607361  109696436 2020-12-28          IS101
607753  109699161 2020-12-29          IS101
608195  109701247 2020-12-30          IS101
608263  109701696 2020-12-30          IS101
608945  109703421 2020-12-31          IS101

[3153 rows x 3 columns]

In [23]:
bike_wypadki2018_20 = bike_wypadki2018_20.groupby("DATA_ZDARZ")["ID"].count()
bike_wypadki2018_20

DATA_ZDARZ
2018-01-02    1
2018-01-04    1
2018-01-05    2
2018-01-06    1
2018-01-09    1
             ..
2020-12-23    1
2020-12-28    2
2020-12-29    1
2020-12-30    2
2020-12-31    1
Name: ID, Length: 844, dtype: int64

In [24]:
bike_wypadki2018_20.to_excel("bike_zdarzenia_warszawa2018_21.xlsx")

### ≈örednia liczba lat kierowania 01.2018 - 12.2020

≈örednia liczba lat kierowania pojazdem os√≥b biorƒÖcych udzia≈Ç w zdarzeniach drogowych w danym dniu

In [25]:
years_wypadki2018_20 = warszawa2018_20[['ID','DATA_ZDARZ','LICZBA_LAT_KIEROWANIA']]
years_wypadki2018_20

               ID DATA_ZDARZ  LICZBA_LAT_KIEROWANIA
0       106651967 2018-01-01                    NaN
1       106651967 2018-01-01                    NaN
2       106651967 2018-01-01                    NaN
3       106651967 2018-01-01                    NaN
4       106651967 2018-01-01                    NaN
...           ...        ...                    ...
609040  109702103 2020-12-31                    NaN
609041  109702103 2020-12-31                    NaN
609042  109702103 2020-12-31                    NaN
609043  109702103 2020-12-31                   32.0
609044  109702103 2020-12-31                   40.0

[609045 rows x 3 columns]

In [31]:
years_wypadki2018_20 = years_wypadki2018_20.groupby("DATA_ZDARZ")["LICZBA_LAT_KIEROWANIA"].mean()
years_wypadki2018_20

DATA_ZDARZ
2018-01-01    14.954545
2018-01-02    19.423729
2018-01-03    18.035503
2018-01-04    19.662162
2018-01-05    17.492958
                ...
2020-12-27    15.315789
2020-12-28    20.020000
2020-12-29    16.906977
2020-12-30    16.248227
2020-12-31    16.414634
Name: LICZBA_LAT_KIEROWANIA, Length: 1096, dtype: float64

In [32]:
years_wypadki2018_20.to_excel("years_zdarzenia_warszawa2018_21.xlsx")

### Liczba zdarze≈Ñ drogowych, w kt√≥rych bra≈Çy udzia≈Ç osoby pod wp≈Çywem alkoholu 01.2018-12.2020

In [33]:
alcohol_wypadki2018_20 = warszawa2018_20[['ID','DATA_ZDARZ','SUSW_KOD']]
alcohol_wypadki2018_20

               ID DATA_ZDARZ SUSW_KOD
0       106651967 2018-01-01      NaN
1       106651967 2018-01-01      NaN
2       106651967 2018-01-01      NaN
3       106651967 2018-01-01      NaN
4       106651967 2018-01-01      NaN
...           ...        ...      ...
609040  109702103 2020-12-31      NaN
609041  109702103 2020-12-31      NaN
609042  109702103 2020-12-31      NaN
609043  109702103 2020-12-31      NaN
609044  109702103 2020-12-31      NaN

[609045 rows x 3 columns]

In [34]:
alcohol_wypadki2018_20.drop(alcohol_wypadki2018_20.loc[alcohol_wypadki2018_20['SUSW_KOD']!='A'].index, inplace=True)
alcohol_wypadki2018_20

C:\Users\aleks\anaconda3\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

               ID DATA_ZDARZ SUSW_KOD
267     106652816 2018-01-02        A
533     106652400 2018-01-02        A
1402    106656493 2018-01-04        A
4479    106681249 2018-01-09        A
5406    106669026 2018-01-11        A
...           ...        ...      ...
605867  109690337 2020-12-23        A
606747  109753215 2020-12-24        A
606766  109693475 2020-12-25        A
606922  109693731 2020-12-26        A
608305  109700625 2020-12-30        A

[575 rows x 3 columns]

In [35]:
alcohol_wypadki2018_20.drop_duplicates(subset='ID')
alcohol_wypadki2018_20

               ID DATA_ZDARZ SUSW_KOD
267     106652816 2018-01-02        A
533     106652400 2018-01-02        A
1402    106656493 2018-01-04        A
4479    106681249 2018-01-09        A
5406    106669026 2018-01-11        A
...           ...        ...      ...
605867  109690337 2020-12-23        A
606747  109753215 2020-12-24        A
606766  109693475 2020-12-25        A
606922  109693731 2020-12-26        A
608305  109700625 2020-12-30        A

[575 rows x 3 columns]

In [36]:
alcohol_wypadki2018_20 = alcohol_wypadki2018_20.groupby("DATA_ZDARZ")["ID"].count()
alcohol_wypadki2018_20

DATA_ZDARZ
2018-01-02    2
2018-01-04    1
2018-01-09    1
2018-01-11    1
2018-01-13    2
             ..
2020-12-23    1
2020-12-24    1
2020-12-25    1
2020-12-26    1
2020-12-30    1
Name: ID, Length: 436, dtype: int64

In [37]:
alcohol_wypadki2018_20.to_excel("alcohol_zdarzenia_warszawa2018_21.xlsx")

### Liczba ofiar ≈õmiertelnych dziennie 01.2018-12.2020

In [66]:
dead_wypadki2018_20 = warszawa2018_20[['ID','DATA_ZDARZ','STUC_KOD']]
dead_wypadki2018_20

               ID DATA_ZDARZ STUC_KOD
0       106651967 2018-01-01      NaN
1       106651967 2018-01-01      NaN
2       106651967 2018-01-01      NaN
3       106651967 2018-01-01      NaN
4       106651967 2018-01-01      NaN
...           ...        ...      ...
609040  109702103 2020-12-31      NaN
609041  109702103 2020-12-31      NaN
609042  109702103 2020-12-31      NaN
609043  109702103 2020-12-31      NaN
609044  109702103 2020-12-31      NaN

[609045 rows x 3 columns]

ZMIENNE:

ZC - zmar≈Çy w ciƒÖgu 30 dni

ZM - zmar≈Çy na miejscu

In [67]:
dead_wypadki2018_20 = dead_wypadki2018_20.drop(dead_wypadki2018_20[(dead_wypadki2018_20['STUC_KOD'] != 'ZC') & (dead_wypadki2018_20['STUC_KOD'] != 'ZM')].index)
dead_wypadki2018_20

               ID DATA_ZDARZ STUC_KOD
6896    106672449 2018-01-13       ZM
11022   106689871 2018-01-20       ZC
17504   106707101 2018-02-01       ZC
23976   106727546 2018-02-12       ZM
33791   106770913 2018-03-01       ZC
...           ...        ...      ...
571108  109443567 2020-10-06       ZM
574196  109463660 2020-10-11       ZC
587043  109530905 2020-11-10       ZC
590188  109555818 2020-11-19       ZM
605867  109690337 2020-12-23       ZC

[123 rows x 3 columns]

In [68]:
dead_wypadki2018_20 = dead_wypadki2018_20.groupby("DATA_ZDARZ").count()
dead_wypadki2018_20

            ID  STUC_KOD
DATA_ZDARZ
2018-01-13   1         1
2018-01-20   1         1
2018-02-01   1         1
2018-02-12   1         1
2018-03-01   1         1
...         ..       ...
2020-10-06   1         1
2020-10-11   1         1
2020-11-10   1         1
2020-11-19   1         1
2020-12-23   1         1

[112 rows x 2 columns]

In [69]:
dead_wypadki2018_20.to_excel("dead_zdarzenia_warszawa2018_21.xlsx")

### Liczba rannych dziennie 01.2018 - 12.2020

In [70]:
injured_wypadki2018_20 = warszawa2018_20[['ID','DATA_ZDARZ','STUC_KOD']]

ZMIENNE:

RL - ranny lekko

RC - ranny ciƒô≈ºko

In [71]:
injured_wypadki2018_20 = injured_wypadki2018_20.drop(injured_wypadki2018_20[(injured_wypadki2018_20['STUC_KOD'] != 'RL') & (injured_wypadki2018_20['STUC_KOD'] != 'RC')].index)
injured_wypadki2018_20

               ID DATA_ZDARZ STUC_KOD
134     106651385 2018-01-01       RC
164     106681303 2018-01-01       RL
165     106681303 2018-01-01       RL
166     106681303 2018-01-01       RL
192     106651783 2018-01-02       RL
...           ...        ...      ...
606393  109693363 2020-12-24       RL
606400  109692934 2020-12-24       RL
606890  109696059 2020-12-26       RL
607235  109697213 2020-12-28       RL
608305  109700625 2020-12-30       RC

[2983 rows x 3 columns]

In [72]:
injured_wypadki2018_20 = injured_wypadki2018_20.groupby("DATA_ZDARZ").count()
injured_wypadki2018_20

            ID  STUC_KOD
DATA_ZDARZ
2018-01-01   4         4
2018-01-02   6         6
2018-01-03   1         1
2018-01-04   5         5
2018-01-05   3         3
...         ..       ...
2020-12-23   6         6
2020-12-24   3         3
2020-12-26   1         1
2020-12-28   1         1
2020-12-30   1         1

[935 rows x 2 columns]

In [73]:
injured_wypadki2018_20.to_excel("injured_zdarzenia_warszawa2018_21.xlsx")

### Liczba obcokrajowc√≥w biorƒÖcych udzia≈Ç w zdarzeniach drogowych dziennie 01.2018-12.2020

In [74]:
foreigners_wypadki2018_20 = warszawa2018_20[['ID','DATA_ZDARZ','OBCOKRAJOWIEC']]

In [75]:
foreigners_wypadki2018_20 = foreigners_wypadki2018_20.drop(foreigners_wypadki2018_20[(foreigners_wypadki2018_20['OBCOKRAJOWIEC'] != 'T')].index)
foreigners_wypadki2018_20

               ID DATA_ZDARZ OBCOKRAJOWIEC
489     106652815 2018-01-02             T
519     106653785 2018-01-02             T
685     106652576 2018-01-02             T
1333    106658831 2018-01-03             T
1435    106657954 2018-01-04             T
...           ...        ...           ...
608732  109702692 2020-12-31             T
608821  109703551 2020-12-31             T
608858  109703689 2020-12-31             T
608913  109703459 2020-12-31             T
608946  109703421 2020-12-31             T

[4277 rows x 3 columns]

In [76]:
foreigners_wypadki2018_20 = foreigners_wypadki2018_20.groupby("DATA_ZDARZ").count()
foreigners_wypadki2018_20

            ID  OBCOKRAJOWIEC
DATA_ZDARZ
2018-01-02   3              3
2018-01-03   1              1
2018-01-04   2              2
2018-01-05   1              1
2018-01-06   2              2
...         ..            ...
2020-12-27   4              4
2020-12-28  10             10
2020-12-29  10             10
2020-12-30  14             14
2020-12-31   5              5

[1000 rows x 2 columns]

In [77]:
foreigners_wypadki2018_20.to_excel("foreigners_zdarzenia_warszawa2018_21.xlsx")